#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jyablonski_prac/github-terraform-demo/runs/run-4Gn73kjzMZ5joAKd

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
snowflake_database.NBA_ELT_DB: Refreshing state... [id=NBA_ELT_DB]
snowflake_schema.NBA_AIRFLOW: Refreshing state... [id=NBA_ELT_DB|NBA_AIRFLOW]
snowflake_schema.NBA_AIRFLOW_QA: Refreshing state... [id=NBA_ELT_DB|NBA_AIRFLOW_QA]
snowflake_schema.TEST_SCHEMA: Refreshing state... [id=NBA_ELT_DB|TEST_SCHEMA]
aws_iam_group.jacobs_github_group: Refreshing state... [id=github-ecr-cicd]
aws_iam_user.jacobs_github_user: Refreshing state... [id=jacobs-github-ci]
aws_iam_role.jacobs_ecs_role: Refreshing state... [id=jacobs_ecs_role]
aws_s3_bucket.jyablonski_lambda_bucket: Refreshing state... [id=jyablonski-lambda-bucket]
aws_s3_bucket.jacobs_bucket_tf: Refreshing state... [id=jacobsbucket97]
aws_cloudwatch_event_rule.etl_rule: Refreshing state... [id=python_scheduled_task_prod]
aws_ecr_repository.jacobs_repo: Refreshing state... [id=jacobs_repo]
aws_cloudwatch_log_group.jacobs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_function]
aws_cloudwatch_event_rule.every_15_mins: Refreshing state... [id=python_scheduled_task_test]
aws_iam_policy.jacobs_lambda_logging: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda_logging]
aws_s3_bucket.jyablonski_unhappy_bucket: Refreshing state... [id=jyablonski-unhappy-bucket]
aws_vpc.jacobs_vpc_tf: Refreshing state... [id=vpc-00ef7bc92037b5bf0]
aws_s3_bucket.jyablonski_tf_cicd_bucket: Refreshing state... [id=jyablonski-tf-cicd-bucket]
aws_cloudwatch_log_group.aws_ecs_logs_airflow: Refreshing state... [id=jacobs_ecs_logs_airflow]
aws_key_pair.airflow_ec2_key: Refreshing state... [id=airflow-ec2-key]
aws_iam_role.jacobs_ecs_ecr_role: Refreshing state... [id=jacobs_ecs_ecr_role]
aws_iam_user.jacobs_terraform_user: Refreshing state... [id=jacobs-terraform-user]
aws_cloudwatch_log_group.aws_ecs_logs: Refreshing state... [id=jacobs_ecs_logs]
aws_iam_role.jacobs_lambda_s3_role: Refreshing state... [id=jacobs_lambda_s3_role]
aws_ssm_parameter.jacobs_ssm_prac_secret: Refreshing state... [id=jacobs_ssm_pg_user]
aws_iam_user.jacobs_airflow_user: Refreshing state... [id=jacobs_airflow_user]
aws_ecs_cluster.jacobs_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:324816727452:cluster/jacobs_fargate_cluster]
aws_ssm_parameter.jacobs_ssm_prac_public: Refreshing state... [id=jacobs_ssm_test]
aws_iam_group_policy_attachment.jacobs_github_group_policy_attach: Refreshing state... [id=github-ecr-cicd-20210828175249204100000001]
aws_iam_group_membership.jacobs_github_group_attach: Refreshing state... [id=tf-testing-group-membership]
aws_ecr_lifecycle_policy.jacobs_repo_policy: Refreshing state... [id=jacobs_repo]
aws_iam_user_policy_attachment.jacobs_terraform_user_attachment: Refreshing state... [id=jacobs-terraform-user-20211211210959483500000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ecr: Refreshing state... [id=jacobs_airflow_user-20211018231134709200000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_s3: Refreshing state... [id=jacobs_airflow_user-20211107232055534100000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_execution: Refreshing state... [id=jacobs_airflow_user-20211018230933480900000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ses: Refreshing state... [id=jacobs_airflow_user-20211018230933484100000002]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment: Refreshing state... [id=jacobs_airflow_user-20211011013703213600000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ssm: Refreshing state... [id=jacobs_airflow_user-20211124210309375300000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_cloudwatch_logs: Refreshing state... [id=jacobs_airflow_user-20211230231428753500000001]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment: Refreshing state... [id=jacobs_ecs_role-20210828175249551700000003]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_ses: Refreshing state... [id=jacobs_ecs_role-20210904181629178300000001]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_s3: Refreshing state... [id=jacobs_ecs_role-20211107185721292100000001]
aws_iam_role_policy_attachment.jacobs_ecs_ecr_role_attachment: Refreshing state... [id=jacobs_ecs_ecr_role-20210828175249545600000002]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment2: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438866400000002]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment3: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438870600000003]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment1: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438861200000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_4: Refreshing state... [id=jacobs_lambda_s3_role-20211222000709626900000001]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=jacobs_lambda_s3_role-20211115225458369200000001]
aws_lambda_function.jacobs_s3_lambda_function: Refreshing state... [id=jacobs_lambda_function]
aws_subnet.jacobs_public_subnet_2: Refreshing state... [id=subnet-0047afa4a7e93ec89]
aws_subnet.jacobs_public_subnet: Refreshing state... [id=subnet-0652b6b91d94ebcd0]
aws_internet_gateway.jacobs_gw: Refreshing state... [id=igw-021b87557060ce529]
aws_security_group.jacobs_task_security_group_tf: Refreshing state... [id=sg-0e3e9289166404b84]
aws_route_table.jacobs_public_route_table: Refreshing state... [id=rtb-09226b87b7cd35ec8]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=jyablonski-lambda-bucket]
aws_lambda_permission.allow_bucket1: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_ssm_parameter.jacobs_ssm_sg_task: Refreshing state... [id=jacobs_ssm_sg_task]
aws_security_group.jacobs_rds_security_group_tf: Refreshing state... [id=sg-04be859fa9163a50a]
aws_ssm_parameter.jacobs_ssm_subnet2: Refreshing state... [id=jacobs_ssm_subnet2]
aws_route_table_association.jacobs_public_route_2: Refreshing state... [id=rtbassoc-0e5a3b38154f8baf6]
aws_route_table_association.jacobs_public_route: Refreshing state... [id=rtbassoc-0b0bbb75130f63d05]
aws_ssm_parameter.jacobs_ssm_subnet1: Refreshing state... [id=jacobs_ssm_subnet1]
aws_db_subnet_group.jacobs_subnet_group: Refreshing state... [id=jacobs-subnet-group]
aws_instance.jacobs_ec2_airflow: Refreshing state... [id=i-0e9fc7c5f56bee3fe]
aws_db_instance.jacobs_rds_tf: Refreshing state... [id=jacobs-rds-server]
aws_ecs_task_definition.jacobs_ecs_task: Refreshing state... [id=jacobs_task]
aws_ecs_task_definition.jacobs_ecs_task_airflow: Refreshing state... [id=jacobs_task_airflow]
aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=python_scheduled_task_prod-jacobs_target_id]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.jacobs_ec2_airflow has changed
  ~ resource "aws_instance" "jacobs_ec2_airflow" {
        id                                   = "i-0e9fc7c5f56bee3fe"
      ~ security_groups                      = [
          - "sg-0e3e9289166404b84",
        ]
        tags                                 = {
            "Environment" = "Dev"
            "Name"        = "Jacob's EC2 Airflow Server"
        }
        # (28 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.jacobs_s3_lambda_function has changed
  ~ resource "aws_lambda_function" "jacobs_s3_lambda_function" {
        id                             = "jacobs_lambda_function"
      ~ last_modified                  = "2021-12-29T21:43:43.906+0000" -> "2022-01-14T02:26:19.642+0000"
        tags                           = {}
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.jacobs_rds_security_group_tf has changed
  ~ resource "aws_security_group" "jacobs_rds_security_group_tf" {
        id                     = "sg-04be859fa9163a50a"
      ~ ingress                = (sensitive)
        name                   = "jacobs_security_group for rds"
        tags                   = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.jacobs_ec2_airflow must be replaced
-/+ resource "aws_instance" "jacobs_ec2_airflow" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:324816727452:instance/i-0e9fc7c5f56bee3fe" -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0e9fc7c5f56bee3fe" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0a9dbfc3dbc6da324" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-138.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.138" -> (known after apply)
      ~ public_dns                           = "ec2-54-227-11-169.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.227.11.169" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0e3e9289166404b84",
        ]
        tags                                 = {
            "Environment" = "Dev"
            "Name"        = "Jacob's EC2 Airflow Server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0e3e9289166404b84",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0b4fcd353dcced722" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lambda_permission.allow_bucket_jacobsbucket97 will be created
  + resource "aws_lambda_permission" "allow_bucket_jacobsbucket97" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:us-east-1:324816727452:function:jacobs_lambda_function"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = "arn:aws:s3:::jacobsbucket97"
      + statement_id  = "AllowExecutionFromS3Bucketjacobsbucket97"
    }

  # aws_s3_bucket_notification.bucket_notification_jacobsbucket97 will be created
  + resource "aws_s3_bucket_notification" "bucket_notification_jacobsbucket97" {
      + bucket = "jacobsbucket97"
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "boxscores/"
          + filter_suffix       = ".parquet"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:us-east-1:324816727452:function:jacobs_lambda_function"
        }
    }

  # aws_security_group.jacobs_rds_security_group_tf will be updated in-place
  ~ resource "aws_security_group" "jacobs_rds_security_group_tf" {
        id                     = "sg-04be859fa9163a50a"
      ~ ingress                = (sensitive)
        name                   = "jacobs_security_group for rds"
        tags                   = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.


```
</details>
*Pusher: @jyablonski, Action: `pull_request`*